Revit 2024 API
BuiltInFailures.CopyPasteFailures.CannotCopyLockedWarn Property
 Can't copy pinned element.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId CannotCopyLockedWarn { get; }
Visual Basic
Public Shared ReadOnly Property CannotCopyLockedWarn As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ CannotCopyLockedWarn {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.CopyPasteFailures Class
Autodesk.Revit.DB Namespace